
`
旅途网订单系统
2019-09 - 2019-11
项目描述：oa重构项目，使用vue cli3开发，组件化结构，数据驱动；
1、使用vue全家桶，各功能模块组件化封装完成各种图表及增删改查业务。
2、使用element-ui框架，匹配不同设备屏幕。
3、结合钉钉扫码登录。
4、完成模拟多页面切换。
5、使用vuex解决数据字典问题。
应用技术：html5+css3、javascript、vue、vuex、vue-route、vxe-table、vue-echarts
`
`
越捷航空
2019-07 - 2019-08
项目描述：越捷航空国内代理网站。
1、实现ui设计图。
2、使用i18n完成双语言切换。
3、对数据交互进行加密。
4、与微信小程序共享用户。
应用技术：html5+css3、javascript、vue、vuex、vue-route、i18n
`
`
旅途国际
2019-05 - 2019-07
项目描述：微信小程序，提供国际机票购买服务。
1、自主设计产品业务流程。
2、完成功能模块化，提高代码复用度。
3、引入npm包。
应用技术：javascript、dayjs
`
`
旅途网报表系统
2019-01 - 2019-04
项目描述：北京旅途商务服务有限公司后自动化报表系统，可配置的数据可视化平台。
1、使用vue全家桶，模块化结构，提高代码复用度。
2、使用element-ui、ECharts等完成组件化模块，简单的配置即可将数据以表格或图表形式展现。
3、为业务和后端赋能。
应用技术： html5+css3、javascript、vue、vuex、vue-route、Axios、less
`
`
旅途网管理系统
2017-11 - 2019-11
项目描述：北京旅途商务服务有限公司后台管理系统
1、使用bootstrap，完成架构搭建及主体业务。
2、不断更新及维护。
3、使用jquery等js类库快速开发。
4、使用requirejs优化js依赖。
应用技术：html5+css3、javascript、jQuery、bootstrap、template、WdatePicker、WebUploader、moment、validate
`
`
出票助手
2018-05 - 2018-07
项目描述：基于chrome浏览器的一个出票辅助插件，包含几大国际航司的出票和订单查询功能。
1、完成一键从航班查询到信息填写，信息确认。
2、完成各航司变量信息可配置。
3、埋点以进行纪录，并完成纪录数据的可视化。
4、根据航司更新不断维护插件可用性。
应用技术：jQuery、JavaScript
`

`
北京调果师投资管理有限公司
2017.09-2017.11
1.对现有的页面进行性能优化、进行代码的调试、bug修复、浏览器兼容性调优。
2.负责各类产品PC端/移动端开发工作。
3.使用ajax技术实现页面动态加载后台数据。
4.与后台工程师协作，完成数据交互、动态信息展现。
5.与其他同事共享开发经验，优化网站的功能和性能。
`